# sem2

#ЗАДАЧА 1.
# Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.

# Пример:

# - 6782 -> 23
# - 0,56 -> 11


#x = input('Введите число ')


#def summa(x):
#    if float(x) < 0:
#        x = float(x) * (-1)
#    number = 0
#
 #   for i in str(x):
#        if i != '.':
#           number += int(i)
#    return number


#print(f'Сумма чисел равна {summa(x)}')


#ЗАДАЧА 2

# Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.

# Пример:

# - пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)


#N = int(input('Введите число '))
#
#f = 1
#for i in range(N):
#    i = i + 1
#   f = i * f
#    print(f, end=" ")


#    ЗАДАЧА3

# 3.Задайте список из n чисел последовательности $(1+\frac 1 n)^n$ и выведите на экран их сумму.


n = int(input('Введите количество чисел в списке '))

def numbers(n):
    summ = 0
    for i in range(n):
        a = int(input(f'Введи число {i + 1} '))
        a = (1+1/a)**a
        summ = a + summ
        i += 1
    return summ

print('Сумма чисел равна',round((numbers(n)), 2))
